app/Controllers/GoalController.php

SELECT *
FROM `goals`
WHERE `goals`.`id` = '14'
---
    public function toggleCompletion($id)
    {
        $goal = $this->goalModel->find($id);