app/Controllers/TacheController.php

SELECT *
FROM `taches`
WHERE `type` = 'group'
---
    public function index()
    {
        $tacheModel = new TacheModel();
        $data['personalTaches'] = $tacheModel->where('type', 'personal')->findAll(); // Personal tasks
        $data['groupTaches'] = $tacheModel->where('type', 'group')->findAll(); // Group tasks

INSERT INTO `taches` (`utilisateur_id`, `titre`, `description`, `type`, `statut`, `date_creation`, `date_modification`) VALUES ('14', 'chart ', 'il faut qu il affiche et recupere les donnes from data base ', 'personal', 'en attente', '2024-12-04 14:09:34', '2024-12-04 14:09:34')
---
    public function createTask()
    {
        // Vérifiez si l'utilisateur est connecté
        $userId = session()->get('user')['id'] ?? null;

        if (!$userId) {
            // Si l'utilisateur n'est pas connecté, redirigez-le vers la page de connexion
            session()->setFlashdata('error', 'Vous devez être connecté pour créer une tâche');
            return redirect()->to('/auth');
        }

        // Initialisation du modèle
        $tacheModel = new TacheModel();

        // Enregistrer la tâche
        $tacheModel->save([
            'utilisateur_id' => $userId, // Utilisez l'ID de l'utilisateur connecté
            'titre' => $this->request->getVar('titre'),
            'description' => $this->request->getVar('description'),
            'type' => $this->request->getVar('type'), // personal or group
            'statut' => 'en attente', // Default status
            'date_creation' => date('Y-m-d H:i:s'),
            'date_modification' => date('Y-m-d H:i:s')
        ]);

DELETE FROM `taches`
WHERE `id` IN ('3')
---
    public function deleteTask($id)
    {
        $tacheModel = new TacheModel();
        $tacheModel->delete($id);