app/Models/GoalModel.php

    public function getUserGoals($userId)
    {
        return $this->where('user_id', $userId)->findAll();
---
SELECT *
FROM `goals`
WHERE `user_id` = '14'

    public function createGoal($data)
    {
        return $this->insert($data);
---
INSERT INTO `goals` (`user_id`, `text`, `completed`) VALUES ('14', 'healthy life', 0)

    public function toggleCompletion($id, $status)
    {
        return $this->update($id, ['completed' => $status]);
---
UPDATE `goals` SET `completed` = 1
WHERE `goals`.`id` IN ('14')

    public function deleteGoal($id)
    {
        return $this->delete($id);
---
DELETE FROM `goals`
WHERE `id` IN ('22')